andreq114/SmartFridgeLPC/board/pin_mux.c
    const uint32_t EMC_D13 = (/* Pin is configured as EMC_D(13) */
                              IOCON_PIO_FUNC6 |
                              /* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Input function is not inverted */
                              IOCON_PIO_INV_DI |
                              /* Enables digital function */
                              IOCON_PIO_DIGITAL_EN |
                              /* Input filter disabled */
                              IOCON_PIO_INPFILT_OFF |
                              /* Fast mode, slew rate control is disabled */
                              IOCON_PIO_SLEW_FAST |
                              /* Open drain is disabled */
                              IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN29 (coords: C11) is configured as EMC_D(13) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_EMC_D13_PORT, BOARD_INITPINS_EMC_D13_PIN, EMC_D13);

    const uint32_t EMC_D14 = (/* Pin is configured as EMC_D(14) */
                              IOCON_PIO_FUNC6 |
                              /* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Input function is not inverted */
                              IOCON_PIO_INV_DI |
                              /* Enables digital function */
                              IOCON_PIO_DIGITAL_EN |
                              /* Input filter disabled */
                              IOCON_PIO_INPFILT_OFF |
                              /* Fast mode, slew rate control is disabled */
                              IOCON_PIO_SLEW_FAST |
                              /* Open drain is disabled */
                              IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN30 (coords: A8) is configured as EMC_D(14) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_EMC_D14_PORT, BOARD_INITPINS_EMC_D14_PIN, EMC_D14);

    const uint32_t EMC_D15 = (/* Pin is configured as EMC_D(15) */
                              IOCON_PIO_FUNC6 |
                              /* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Input function is not inverted */
                              IOCON_PIO_INV_DI |
                              /* Enables digital function */
                              IOCON_PIO_DIGITAL_EN |
                              /* Input filter disabled */
                              IOCON_PIO_INPFILT_OFF |
                              /* Fast mode, slew rate control is disabled */
                              IOCON_PIO_SLEW_FAST |
                              /* Open drain is disabled */
                              IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN31 (coords: C5) is configured as EMC_D(15) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_EMC_D15_PORT, BOARD_INITPINS_EMC_D15_PIN, EMC_D15);

    const uint32_t EMC_D11 = (/* Pin is configured as EMC_D(11) */
                              IOCON_PIO_FUNC6 |
                              /* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Input function is not inverted */
                              IOCON_PIO_INV_DI |
                              /* Enables digital function */
                              IOCON_PIO_DIGITAL_EN |
                              /* Input filter disabled */
                              IOCON_PIO_INPFILT_OFF |
                              /* Fast mode, slew rate control is disabled */
                              IOCON_PIO_SLEW_FAST |
                              /* Open drain is disabled */
                              IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN4 (coords: D4) is configured as EMC_D(11) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_EMC_D11_PORT, BOARD_INITPINS_EMC_D11_PIN, EMC_D11);

    const uint32_t EMC_A4 = (/* Pin is configured as EMC_A(4) */
                             IOCON_PIO_FUNC6 |
                             /* No addition pin function */
                             IOCON_PIO_MODE_INACT |
                             /* Input function is not inverted */
                             IOCON_PIO_INV_DI |
                             /* Enables digital function */
                             IOCON_PIO_DIGITAL_EN |
                             /* Input filter disabled */
                             IOCON_PIO_INPFILT_OFF |
                             /* Fast mode, slew rate control is disabled */
                             IOCON_PIO_SLEW_FAST |
                             /* Open drain is disabled */
                             IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN5 (coords: E4) is configured as EMC_A(4) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_EMC_A4_PORT, BOARD_INITPINS_EMC_A4_PIN, EMC_A4);

    const uint32_t EMC_A5 = (/* Pin is configured as EMC_A(5) */
                             IOCON_PIO_FUNC6 |
                             /* No addition pin function */
                             IOCON_PIO_MODE_INACT |
                             /* Input function is not inverted */
                             IOCON_PIO_INV_DI |
                             /* Enables digital function */
                             IOCON_PIO_DIGITAL_EN |
                             /* Input filter disabled */
                             IOCON_PIO_INPFILT_OFF |
                             /* Fast mode, slew rate control is disabled */
                             IOCON_PIO_SLEW_FAST |
                             /* Open drain is disabled */
                             IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN6 (coords: G4) is configured as EMC_A(5) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_EMC_A5_PORT, BOARD_INITPINS_EMC_A5_PIN, EMC_A5);

    const uint32_t EMC_A6 = (/* Pin is configured as EMC_A(6) */
                             IOCON_PIO_FUNC6 |
                             /* No addition pin function */
                             IOCON_PIO_MODE_INACT |
                             /* Input function is not inverted */
                             IOCON_PIO_INV_DI |
                             /* Enables digital function */
                             IOCON_PIO_DIGITAL_EN |
                             /* Input filter disabled */
                             IOCON_PIO_INPFILT_OFF |
                             /* Fast mode, slew rate control is disabled */
                             IOCON_PIO_SLEW_FAST |
                             /* Open drain is disabled */
                             IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN7 (coords: N1) is configured as EMC_A(6) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_EMC_A6_PORT, BOARD_INITPINS_EMC_A6_PIN, EMC_A6);

    const uint32_t EMC_A7 = (/* Pin is configured as EMC_A(7) */
                             IOCON_PIO_FUNC6 |
                             /* No addition pin function */
                             IOCON_PIO_MODE_INACT |
                             /* Input function is not inverted */
                             IOCON_PIO_INV_DI |
                             /* Enables digital function */
                             IOCON_PIO_DIGITAL_EN |
                             /* Input filter disabled */
                             IOCON_PIO_INPFILT_OFF |
                             /* Fast mode, slew rate control is disabled */
                             IOCON_PIO_SLEW_FAST |
                             /* Open drain is disabled */
                             IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN8 (coords: P8) is configured as EMC_A(7) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_EMC_A7_PORT, BOARD_INITPINS_EMC_A7_PIN, EMC_A7);

